app/controllers/carts_controller.rb

  def destroy

    unless @cart.id == session[:cart_id]
    end

    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 3]]