app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id]).id
    @line_item = @cart.line_items.new(product_id: product)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-03-05 20:35:40.073544"], ["updated_at", "2019-03-05 20:35:40.073544"]]
INSERT INTO "line_items" ("cart_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 7], ["product_id", 1], ["created_at", "2019-03-05 21:12:16.487087"], ["updated_at", "2019-03-05 21:12:16.487087"]]