app/controllers/concerns/current_cart.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-03-05 20:35:40.073544"], ["updated_at", "2019-03-05 20:35:40.073544"]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def set_cart
    @cart = Cart.find_by(id: session[:cart_id]) || Cart.create